<?php
// +----------------------------------------------------------------------
// | 海豚PHP框架 [ DolphinPHP ]
// +----------------------------------------------------------------------
// | 版权所有 2016~2017 河源市卓锐科技有限公司 [ http://www.zrthink.com ]
// +----------------------------------------------------------------------
// | 官方网站: http://dolphinphp.com
// +----------------------------------------------------------------------
// | 开源协议 ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------

/**
 * 插件配置信息
 */
return [
    ['text', 'text', '单行文本', '提示',['length[2,40]'], 'x','required',''],
    ['radio', 'status', '单选', '', ['1' => '开启', '0' => '关闭'], 0],
    ['textarea', 'textarea', '多行文本', '','[length[20,40]]','123123','100px',''],
    ['checkbox', 'checkbox', '多选', '提示', ['1' => '是', '0' => '否'], 0],
    ['group',
        [
            '分组1' => [
                ['radio', 'status1', '单选', '', ['1' => '开启', '0' => '关闭'], 1],
                ['text', 'text1', '单行文本', '提示','', 'x'],
                ['textarea', 'textarea1', '多行文本2', '提示'],
                ['checkbox', 'checkbox2', '多选', '提示', ['1' => '是', '0' => '否'], [0,1]],
            ],
            '分组2' => [
                ['textarea', 'textarea2', '多行文本', '提示'],
                ['checkbox', 'checkbox12', '多选', '提示', ['1' => '是', '0' => '否'], 0],
            ]
        ]
    ]
];
